[LWS_Crasher X2SoldierClassTemplate]

DisplayName="粉碎者"
ClassSummary="粉碎者擅长近距离攻击多个目标。他们同样擅长冲向敌人阵地，或者在小队撤离时担任后卫。"

LeftAbilityTreeTitle="Shell Shock"
RightAbilityTreeTitle="Escape Artist"
AbilityTreeTitles[0]="炮弹冲击"
AbilityTreeTitles[1]="削弱"
AbilityTreeTitles[2]="撤离艺术"
AbilityTreeTitles[3]="XCOM"


;This class is only intended for Jane Kelly, so there's only one callsign by default. Feel free to change this.
RandomNickNames[0]="回收者"
;ALPHABETICAL ORDER
PhotoboothSoloBLines_Male[0]="他的刀锋…他们的血！"
PhotoboothSoloBLines_Male[1]="你看不到最后了。"
PhotoboothSoloBLines_Male[2]="他的刀锋会带来正义！"
PhotoboothSoloBLines_Male[3]="接受死亡吧！"
PhotoboothSoloBLines_Male[4]="剑士！死亡贩子。"
PhotoboothSoloBLines_Female[0]="她的刀锋…她们的血！"
PhotoboothSoloBLines_Female[1]="你看不到最后了。"
PhotoboothSoloBLines_Female[2]="她的刀锋会带来正义！"
PhotoboothSoloBLines_Female[3]="接受死亡吧！"
PhotoboothSoloBLines_Female[4]="剑士！死亡贩子。"

[LW2WotC_Formidable X2AbilityTemplate]
LocFriendlyName="护身之盾"
LocLongDescription="这个装置夹在腰带上，提供2个额外的烧蚀生命值和爆炸攻击伤害减少50%。"
LocHelpText="提供2个烧蚀生命值和爆炸攻击伤害减少50%。"
LocPromotionPopupText=""
LocFlyOverText="护身之盾"
